#pragma once

// Name: , Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ABP_FP_Dwarf.ABP_FP_Dwarf_C
// 0x1878 (0x1C58 - 0x03E0)
class UABP_FP_Dwarf_C : public UPlayerFPAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03E0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_939B71D14952B358AE9AC78891745E1B;      // 0x03E8(0x0020)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_23FE83D84D22CD9EE4ACB7921C4A4CF2;      // 0x0408(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_4BC0E684443B6C4CA89999973167578D;// 0x0450(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EF3839744A185612878B378FD9E50C7D;// 0x0478(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_57234F204280EDCDDD85608B124CE868;// 0x04A0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_70F2A2474AA7E859D099CBB702E05624;// 0x04C8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_19510B71447168F478551E94D0BAAD52;// 0x04F0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A80151F24B011A2CCA08A9846E9A149F;// 0x0518(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AF3FFA514BB354788D2B29A8612BAEE3;// 0x0540(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_97D4598A4C1A9F103D20B599A6006E73;// 0x0568(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_855D3DCF449114D56F38DAB30610D222;// 0x0590(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_EB65D84C41981591720740B3B3929496;// 0x05B8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_62F523CA41A6601CEE4096A550BA16A9;// 0x05E0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_843BC645460E6F916ECCD8ABC0A0625C;// 0x0608(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D72EE224DC9E7672F467694451A25BF;// 0x0630(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FF9FEB8A42961DB8B1F06A9D42C5CEB8;// 0x0658(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_406F1A12494A7224FC1396A7D566F007;// 0x0680(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_9EA54B8E4CCD6FA0297AD3A958314161;// 0x06A8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_3BAF855D4EA2D46607E5FC9F238B45F5;// 0x06D0(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_40B8A71542B8FA00D00746AF31C9BC4B;// 0x06F8(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_AA63C49F4C9B352448B8F3958E416319;// 0x0720(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_731B774B408562CB8FB4D99BEBA26509;// 0x0748(0x0028)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_1D95069D4BF999D4DD3215AC49017F2E;// 0x0770(0x0028)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_3ACB2C45445B9DB7E6FF37971A1B8A32;// 0x0798(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_58D7B94047584F53AD2852974608177D;// 0x0810(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_65A96F0B48CC78F4456C2CBC35EDDFDD;// 0x0830(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D342A63A42498D8B61B8BE8944AA2124;// 0x08A8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6EB6D61D40D976871B94AA8251FAD582;// 0x08C8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_66BD629A45CEA015ECCA01ABA753F625;// 0x0940(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_4FD0827B450AB5BEFA6FFB98B01A0A08;// 0x0960(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C40B30394015C80BD08B8DB8F0E37F7B;// 0x09D8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F3B09174490F2F1CC8200CB58FE65BCF;// 0x09F8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_253306814112D60D2C001C9C9AA13AAD;// 0x0A70(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_6A5134F24342EC9A9580FBAB2520AD41;// 0x0A90(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_020EB2F54FB21CC493AAF7B033E1756E;// 0x0B08(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_F0E5149D4D0C0DA4247053A207AC57E6;// 0x0B28(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_5FE808644428625A66E22EB73481B622;// 0x0BA0(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_66ECD03D489F4AA72104D7BEEB3E4990;// 0x0BC0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_25578B1C49649B4AA420CF922982B2C2;// 0x0C38(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_57A7EDF04D3E6ACA59E51B9226F6B3AF;// 0x0CD8(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_2C6191D24C513A14CAEDD99D6D140CF6;// 0x0D50(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_A74D4F5E4BC12E3F032A1B94CDE7E1FF;// 0x0D70(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_BF5A92C04A6814B21B73DA905E20CBB3;// 0x0DE8(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0D25EEFC462716412642788FFEEBEFDA;// 0x0E88(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DAFB98D54CBD76B2A429A8828B03CFD5;// 0x0F00(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_5934B0174AF3D99EDC9C16A89A91F884;// 0x0F20(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_474A84A74BD3F1D325486A9567B3CF2A;// 0x1028(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D8A5CF0546C3A85AEE27259AD40B993F;// 0x1048(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_0072D2CD4DA4D455439303B47B562719;// 0x1068(0x0078)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_8B72B9B947379DD3F396EAADE5EFCA70;// 0x10E0(0x0078)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_91F8FA14472F042B97E523A4AED27E22;// 0x1158(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4509A0DC42DFA87EE15C14B0D06B0CD2;// 0x11F8(0x0020)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_82FADB9E405B613DCC15F7A4B6289FBB;// 0x1218(0x0078)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_C9095CBF48BAE93B2ED0C8B72A7B22B6;// 0x1290(0x0020)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_6896B9064A018A3D4EFFB9BC08FEBE4B;// 0x12B0(0x00B0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_125E1CD84444AB2440069BBD027D1847;// 0x1360(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_249D5B1842C687C20F93A2B98A15CCBF;// 0x1380(0x0108)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_05552877466DC9AE378DEEB4D1BF6D23;// 0x1488(0x0020)
	struct FAnimNode_SaveCachedPose                    AnimGraphNode_SaveCachedPose_51A9F3D4440EC181C8DCA3B63629B724;// 0x14A8(0x00B8)
	struct FAnimNode_UseCachedPose                     AnimGraphNode_UseCachedPose_80C7E59343417D4435DCC480E345E405;// 0x1560(0x0028)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_689B68F4480F17E06E88D184FA3F3690;      // 0x1588(0x0048)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CDBAC8D6436A35107DD33A99D73AECEC;// 0x15D0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CCA8BF3B47B9BF0BAA058C8B81FF66BC;// 0x16D8(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_BB3D1C2749DDF84D5B194A8DB620955E;// 0x17E0(0x0108)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_ADDC45BF43C81BBCDDF09EA00F7946F9;// 0x18E8(0x0108)
	struct FAnimNode_BlendListByBool                   AnimGraphNode_BlendListByBool_6DDE9ED1472F18D4CB44EBBBB22AC464;// 0x19F0(0x00A0)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_C701FFAC4105D8AC812A16BC22693881;// 0x1A90(0x0078)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_ED0142174204DAC08C98C19A86E868C1;// 0x1B08(0x0020)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_D4D7B6E04F24E19B671EA6AEEFA18C2E;// 0x1B28(0x0020)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_A62EAAF14448C40560BE93A85934B96A;// 0x1B48(0x0108)
	class ABP_PlayerCharacter_C*                       BPCharacter;                                              // 0x1C50(0x0008) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ABP_FP_Dwarf.ABP_FP_Dwarf_C");
		return ptr;
	}


	void AnimNotify_Mine();
	void BlueprintInitializeAnimation();
	void StartInspectWeapon();
	void StopInspectWeapon();
	void AnimNotify_BeginBuild();
	void AnimNotify_EndBuild();
	void ExecuteUbergraph_ABP_FP_Dwarf(int* EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
