#pragma once

// Name: , Version: 1.0.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class FSD.AcceptInviteBlueprintCallProxy
// 0x0058 (0x0080 - 0x0028)
class UAcceptInviteBlueprintCallProxy : public UOnlineBlueprintCallProxyBase
{
public:
	struct FScriptMulticastDelegate                    OnSuccess;                                                // 0x0028(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnFailure;                                                // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UObject*                                     WorldContextObject;                                       // 0x0048(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x30];                                      // 0x0050(0x0030) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AcceptInviteBlueprintCallProxy");
		return ptr;
	}


	class UAcceptInviteBlueprintCallProxy* STATIC_AcceptInvite(class UObject** WorldContextObject, struct FString* ListName, struct FString* userId);
};


// Class FSD.Objective
// 0x0090 (0x0188 - 0x00F8)
class UObjective : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnObjectiveUpdated;                                       // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0108(0x0008) MISSED OFFSET
	class UClass*                                      WidgetClass;                                              // 0x0110(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FMissionShouts                              MissionShouts;                                            // 0x0118(0x0038) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       MissionDescription;                                       // 0x0150(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	int                                                CompletionRewardInCredits;                                // 0x0168(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                CompletionRewardInXP;                                     // 0x016C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               ScaleObjectiveToMission;                                  // 0x0170(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               RequiredReturnObjectiveCompleted;                         // 0x0171(0x0001) (BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x6];                                       // 0x0172(0x0006) MISSED OFFSET
	class UMissionStat*                                ObjectiveCompletedStat;                                   // 0x0178(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	int                                                IsPrimaryObjective;                                       // 0x0180(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	float                                              MissionScale;                                             // 0x0184(0x0004) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.Objective");
		return ptr;
	}


	void Receive_StartTracking();
	void OnRep_IsPrimaryObjective();
	bool IsTutorialObjective();
	bool IsPrimary();
	bool IsObjectiveResource(class UResourceData** InResource);
	bool IsCompleted();
	bool HasReplicated();
	int GetRewardXP();
	struct FCreditsReward GetRewardCredits();
	struct FText GetObjectiveText();
	struct FObjectiveMissionIcon STATIC_GetObjectiveMissionIconFromClass(class UClass** objectiveClass);
	class UTexture2D* STATIC_GetObjectiveIconFromClass(class UClass** objectiveClass);
	class UTexture2D* GetObjectiveIcon();
	struct FText STATIC_GetObjectiveDescriptionFromClass(class UClass** objectiveClass, float* missionLength);
	struct FText GetObjectiveDescription(float* missionLength);
	int STATIC_GetObjectiveAmountFromClass(class UClass** objectiveClass, float* missionLength);
	int GetObjectiveAmount(float* missionLength);
	struct FObjectiveMissionIcon GetMissionIcon();
	struct FText GetInMissionText();
	struct FText GetInMissionCounterText();
	class UTexture2D* GetInMissionCounterIcon();
};


// Class FSD.ActivationOjective
// 0x0008 (0x0190 - 0x0188)
class UActivationOjective : public UObjective
{
public:
	int                                                ObjectivesFound;                                          // 0x0188(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	int                                                ObjectivesToFind;                                         // 0x018C(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActivationOjective");
		return ptr;
	}


	void OnRep_ObjectivesToFind(int* prevAmount);
	void OnRep_ObjectivesFound(int* prevAmount);
};


// Class FSD.ActivationObject
// 0x0010 (0x0340 - 0x0330)
class AActivationObject : public AActor
{
public:
	class USingleUsableComponent*                      Usable;                                                   // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	bool                                               HasBeenUsed;                                              // 0x0338(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0339(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActivationObject");
		return ptr;
	}


	void OnUsedBy(class APlayerCharacter** user);
};


// Class FSD.ActorFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UActorFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActorFunctionLibrary");
		return ptr;
	}


	void STATIC_UnlockSpecificCharacters(class UObject** WorldContextObject, TArray<class APlayerCharacter*>* Characters, ECharacterState* UnlockIf, ECharacterState* UnlockTo);
	void STATIC_UnlockCharacters(class UObject** WorldContextObject);
	float STATIC_TimeSince(class UObject** WorldContextObject, float* Time);
	void STATIC_SetScalarParameters(struct FName* ParameterName, float* Value, TArray<class UMaterialInstanceDynamic*>* Materials);
	void STATIC_PlayCueOnClient(class APlayerController** Target, class USoundCue** cue);
	void STATIC_PlayCueOnAll(class UObject** WorldContextObject, class USoundCue** cue);
	float STATIC_PingPong(float* Time, float* Length, bool* normalize);
	float STATIC_MoveTowards(float* current, float* End, float* step);
	void STATIC_LockSpecificCharactersIfState(class UObject** WorldContextObject, TArray<class APlayerCharacter*>* Characters, ECharacterState* stateToLock);
	void STATIC_LockSpecificCharacters(class UObject** WorldContextObject, TArray<class APlayerCharacter*>* Characters);
	bool STATIC_LockSpecificCharacterIfState(class UObject** WorldContextObject, class APlayerCharacter** Character, ECharacterState* LockIf, ECharacterState* LockTo);
	void STATIC_LockCharacters(class UObject** WorldContextObject);
	class UClass* STATIC_LoadWindowWidgetClass();
	class UClass* STATIC_LoadWidgetClass();
	class UClass* STATIC_LoadClass();
	void STATIC_KillActorWithEffects(class AActor** Actor, class USceneComponent** visualsToHide, class USoundCue** deathSound, class UParticleSystem** deathParticles, class UPathfinderCollisionComponent** pathColliderToDisable, class UNiagaraSystem** niagaraDeathParticles);
	bool STATIC_IsWeakPoint(class UFSDPhysicalMaterial** Material);
	bool STATIC_IsInRangeOfLocalPlayer(class AActor** toActor, float* MinDistance, float* MaxDistance);
	bool STATIC_IsCloseToLocalPlayer(class AActor** toActor, float* distance);
	int STATIC_GetTotalHeroLevels(class UObject** WorldContextObject, class UClass** CharacterClass);
	struct FGuid STATIC_GetSavegameID(class UClass** objectClass);
	TArray<class APlayerCharacter*> STATIC_GetPlayersInRange(class UObject** WorldContextObject, struct FVector* Origin, float* Radius, bool* MustBeAlive);
	class UItemID* STATIC_GetItemID(class UClass** itemClass);
	float STATIC_GetHeroXP(class UObject** WorldContextObject, class UClass** HeroClass);
	struct FString STATIC_GetHeroSourceName(class UClass** playerClass);
	float STATIC_GetHeroProgress(class UObject** WorldContextObject, class UClass** CharacterClass);
	struct FText STATIC_GetHeroName(class UClass** playerClass);
	int STATIC_GetHeroLevel(class UObject** WorldContextObject, class UClass** CharacterClass);
	class UInventoryList* STATIC_GetHeroInventoryList(class UPlayerCharacterID** characterID);
	struct FHeroInfo STATIC_GetHeroInfo(class UClass** playerClass);
	class UTexture2D* STATIC_GetHeroImageSmall(class UClass** playerClass);
	class UTexture2D* STATIC_GetHeroImageFullSize(class UClass** playerClass);
	class UTexture2D* STATIC_GetHeroImage(class UClass** playerClass);
	struct FLinearColor STATIC_GetHeroColor(class UClass** playerClass);
	class UActorComponent* STATIC_GetComponentFromClass(class UClass** Actor, class UClass** ComponentClass);
	class UActorComponent* STATIC_GetComponentByClass(class AActor** Actor, class UClass** ComponentClass);
	class UPlayerCharacterID* STATIC_GetCharacterID(class UClass** playerClass);
	TArray<class APlayerCharacter*> STATIC_GetAllPlayerCharacters(class UObject** WorldContext);
	struct FVector STATIC_GetActorTargetCenter(class AActor** TargetActor);
	void STATIC_FSDRemoveBlendable(class UPostProcessComponent** PostProcessComponent, TScriptInterface<class UBlendableInterface>* InBlendableObject);
	void STATIC_FSDRemoveAllWidgets(class UObject** WorldContextObject);
	void STATIC_FSDDumpCallStack(struct FString* Msg);
	class APlayerCharacter* STATIC_FindNearestPlayerCharacter(class UObject** WorldContextObject, struct FVector* fromLocation, float* MaxRadius, bool* MustBeAlive, bool* MustBeUnparalyzed, bool* MustHaveLineOfSight);
	struct FVector STATIC_FindLatejoinDroppodLocation(class AFSDGameMode** GameMode);
	class AActor* STATIC_FindClosestEnemyFromLocation(struct FVector* fromLocation, float* Range, bool* LineOfSightCheck, class UObject** WorldContextObject, struct FVector* Offset);
	class AActor* STATIC_FindClosestEnemyFromActor(class AActor** FromActor, float* Range, bool* LineOfSightCheck, struct FVector* Offset);
	float STATIC_EvaluateRuntimeCurve(class UObject** WorldContextObject, struct FRuntimeFloatCurve* Curve, float* Time);
	void STATIC_DamagePlayersInArea(struct FVector* Origin, class AActor** Instigator, float* Damage, float* Radius, class UDamageClass** DamageClass);
	class UHealthComponentBase* STATIC_DamageIfInRange(float* MaxDistance, float* Damage, class AActor** Target, class AActor** Attacker, class UDamageClass** DamageClass);
	void STATIC_DamageAllInAreaExcept(struct FVector* Origin, class AActor** Instigator, float* Damage, float* blastRadius, float* maxDamageRadius, float* minDamagePercent, TArray<class AActor*>* ignoreActors, float* friendlyFireModifier, class UDamageClass** DamageClass);
	void STATIC_DamageAllInArea(struct FVector* Origin, class AActor** Instigator, float* Damage, float* blastRadius, float* maxDamageRadius, float* minDamagePercent, float* friendlyFireModifier, class UDamageClass** DamageClass);
	float STATIC_AddHeroXP(class UObject** WorldContextObject, class UClass** HeroClass, float* amount);
};


// Class FSD.StatusEffectsFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UStatusEffectsFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.StatusEffectsFunctionLibrary");
		return ptr;
	}


	float STATIC_GetMaxResistance(class UClass** StatusEffect);
	class UDamageClass* STATIC_GetDamageClass(class UClass** StatusEffect);
	bool STATIC_CanTrigger(class UClass** StatusEffect, class AActor** OtherActor);
};


// Class FSD.FrontendBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UFrontendBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FrontendBlueprintLibrary");
		return ptr;
	}


	void STATIC_OpenURLInExternalBrowser(struct FString* URL);
	EFSDTargetPlatform STATIC_FSDTargetPlatform();
};


// Class FSD.GameModeFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UGameModeFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.GameModeFunctionLibrary");
		return ptr;
	}


	struct FTransform STATIC_FindRandomEscapePodLocation(class UObject** WorldContextObject);
	struct FTransform STATIC_FindEscapePodLocationAtDistance(class UObject** WorldContextObject, float* distance, float* aboveDistanceBias);
};


// Class FSD.FSDConversionLibrary
// 0x0000 (0x0028 - 0x0028)
class UFSDConversionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FSDConversionLibrary");
		return ptr;
	}


	struct FVector_NetQuantizeNormal STATIC_VectorToNetQuantizeNormal(struct FVector* Vec);
	struct FVector_NetQuantize STATIC_VectorToNetQuantize(struct FVector* Vec);
	struct FVector STATIC_QuatToVector(struct FQuat* Quat);
	struct FRotator STATIC_QuatToRotator(struct FQuat* Quat);
	struct FVector_NetQuantizeNormal STATIC_QuadToNetQuantizeNormal(struct FQuat* Quat);
	struct FVector STATIC_ComponentToWorldLocation(class USceneComponent** Component);
	struct FVector STATIC_ActorToWorldLocation(class AActor** Actor);
};


// Class FSD.ActorStateComponent
// 0x0050 (0x0148 - 0x00F8)
class UActorStateComponent : public UActorComponent
{
public:
	struct FScriptMulticastDelegate                    OnBeginState;                                             // 0x00F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTickState;                                              // 0x0108(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnEndState;                                               // 0x0118(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	class UActorStateComponent*                        CurrentState;                                             // 0x0128(0x0008) (ExportObject, Net, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UActorStateComponent*                        NextState;                                                // 0x0130(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UActorStateComponent*                        MasterState;                                              // 0x0138(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	float                                              StateActiveTime;                                          // 0x0140(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0144(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActorStateComponent");
		return ptr;
	}


	void OnRep_CurrentState(class UActorStateComponent** PreviousState);
	bool IsStateActive();
	void GotoState();
};


// Class FSD.FSDUserWidget
// 0x0020 (0x0250 - 0x0230)
class UFSDUserWidget : public UUserWidget
{
public:
	struct FScriptMulticastDelegate                    OnVisibilityChanged;                                      // 0x0230(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0240(0x0008) MISSED OFFSET
	class APlayerCharacter*                            Character;                                                // 0x0248(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FSDUserWidget");
		return ptr;
	}


	void STATIC_SetTickEnabled(class UUserWidget** Widget, bool* tickEnabled);
	void SetOpacity(float* Alpha);
	void ScaleByBaseResolution();
	void Refresh();
	void ReceiveNewVisibility(ESlateVisibility* NewVisibility);
	void OnCloseMenuReleased(bool* Handled);
	void OnCloseMenuPressed(bool* Handled);
	bool HasCharacter();
	float GetOpacity();
	class AFSDPlayerState* GetFSDPlayerState();
	class AItem* GetEquippedItem();
	float GetBaseResolutionScale();
	void BP_OnRefresh();
};


// Class FSD.ActorTrackingWidget
// 0x0028 (0x0278 - 0x0250)
class UActorTrackingWidget : public UFSDUserWidget
{
public:
	TWeakObjectPtr<class USceneComponent>              TargetComponent;                                          // 0x0250(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	float                                              WorldHeightOffset;                                        // 0x0258(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              ScaleBy;                                                  // 0x025C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FMargin                                     ScreenMargin;                                             // 0x0260(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                WidgetZOrder;                                             // 0x0270(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0274(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActorTrackingWidget");
		return ptr;
	}


	void SetTargetComponent(class USceneComponent** Component);
	void SetTarget(class AActor** Actor);
	void OnTargetSet(class AActor** NewTarget);
	void OnTargetDistanceChanged(float* distance);
	void OnShow();
	void OnInViewChanged(bool* inView, float* Angle);
	class AActor* GetTarget();
	struct FVector2D GetRenderTranslation();
	bool STATIC_FindScreenPosition(class APlayerController** PlayerController, struct FVector* WorldLocation, struct FMargin* Margin, struct FVector* ScreenCord, float* Angle);
	class UActorTrackingWidget* STATIC_CreateTrackingWidget(class APlayerController** PlayerController, class UClass** WidgetType, class USceneComponent** TargetComponent);
};


// Class FSD.ActorTrackingComponent
// 0x0010 (0x0270 - 0x0260)
class UActorTrackingComponent : public USceneComponent
{
public:
	bool                                               VisibleOnHoldTAB;                                         // 0x0260(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               VisibleFromStart;                                         // 0x0261(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x0262(0x0002) MISSED OFFSET
	TWeakObjectPtr<class UActorTrackingWidget>         Widget;                                                   // 0x0264(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x026C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.ActorTrackingComponent");
		return ptr;
	}


	void ToggleIcon(bool* Visible);
	void OnHoldTAB(bool* IsDown);
	bool IsIconVisible();
};


// Class FSD.AdicPuddle
// 0x0028 (0x0358 - 0x0330)
class AAdicPuddle : public AActor
{
public:
	class USphereComponent*                            SphereTrigger;                                            // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USoundBase*                                  SpawnSound;                                               // 0x0338(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      InflictedStatusEffect;                                    // 0x0340(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0348(0x0008) MISSED OFFSET
	float                                              LifeTime;                                                 // 0x0350(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0354(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AdicPuddle");
		return ptr;
	}


	void OnPuddleEndOverLap(class UPrimitiveComponent** OverlappedComponent, class AActor** OtherActor, class UPrimitiveComponent** OtherComp, int* OtherBodyIndex);
	void OnPuddleBeginOverLap(class UPrimitiveComponent** OverlappedComponent, class AActor** OtherActor, class UPrimitiveComponent** OtherComp, int* OtherBodyIndex, bool* bFromSweep, struct FHitResult* SweepResult);
};


// Class FSD.AfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UAfflictionEffect : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AfflictionEffect");
		return ptr;
	}


	bool ShouldInstantiate();
	void ReceiveEndEffect(class UPawnAfflictionComponent** Target);
	void ReceiveBeginEffect(class UPawnAfflictionComponent** Target);
};


// Class FSD.PawnFrozenUniqueAfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UPawnFrozenUniqueAfflictionEffect : public UAfflictionEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.PawnFrozenUniqueAfflictionEffect");
		return ptr;
	}

};


// Class FSD.PawnBurningUniqueAfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UPawnBurningUniqueAfflictionEffect : public UAfflictionEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.PawnBurningUniqueAfflictionEffect");
		return ptr;
	}

};


// Class FSD.AttachedParticlesAfflictionEffect
// 0x0020 (0x0048 - 0x0028)
class UAttachedParticlesAfflictionEffect : public UAfflictionEffect
{
public:
	class UParticleSystem*                             ParticleEffect;                                           // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UParticleSystem*>                     ParticleEffects;                                          // 0x0030(0x0010) (Edit, EditFixedSize, ZeroConstructor)
	EAfflictionSocket                                  Socket;                                                   // 0x0040(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ScaleToActor;                                             // 0x0041(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0042(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AttachedParticlesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.CharacterShoutAfflictionEffect
// 0x0008 (0x0030 - 0x0028)
class UCharacterShoutAfflictionEffect : public UAfflictionEffect
{
public:
	class UDialogDataAsset*                            Shout;                                                    // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.CharacterShoutAfflictionEffect");
		return ptr;
	}

};


// Class FSD.SoundAfflictionEffect
// 0x0020 (0x0048 - 0x0028)
class USoundAfflictionEffect : public UAfflictionEffect
{
public:
	class USoundCue*                                   BeginSound;                                               // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   EndSound;                                                 // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               Attach;                                                   // 0x0038(0x0001) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	struct FName                                       AttachBone;                                               // 0x003C(0x0008) (Edit, ZeroConstructor, EditConst, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0044(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.SoundAfflictionEffect");
		return ptr;
	}

};


// Class FSD.AttachMeshesAfflictionEffect
// 0x0018 (0x0040 - 0x0028)
class UAttachMeshesAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<struct FAttachMeshesAfflictionItem>         AttachItems;                                              // 0x0028(0x0010) (Edit, ZeroConstructor)
	class UParticleSystem*                             OnRemoveEffect;                                           // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AttachMeshesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.FrozenAfflictionEffect
// 0x0030 (0x0058 - 0x0028)
class UFrozenAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<struct FFrozenAfflictionItem>               IceParts;                                                 // 0x0028(0x0010) (Edit, ZeroConstructor)
	class UMaterialInterface*                          MaterialOverride;                                         // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       ParticleBone;                                             // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<class UMaterialInterface*>                  IceMaterials;                                             // 0x0048(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FrozenAfflictionEffect");
		return ptr;
	}

};


// Class FSD.BurningAfflictionEffect
// 0x0008 (0x0030 - 0x0028)
class UBurningAfflictionEffect : public UAfflictionEffect
{
public:
	EFrozenBitsSize                                    FireParticleSize;                                         // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.BurningAfflictionEffect");
		return ptr;
	}

};


// Class FSD.StaggeredAfflictionEffect
// 0x0000 (0x0028 - 0x0028)
class UStaggeredAfflictionEffect : public UAfflictionEffect
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.StaggeredAfflictionEffect");
		return ptr;
	}

};


// Class FSD.BoneParticlesAfflictionEffect
// 0x0018 (0x0040 - 0x0028)
class UBoneParticlesAfflictionEffect : public UAfflictionEffect
{
public:
	TArray<class UParticleSystem*>                     particles;                                                // 0x0028(0x0010) (Edit, EditFixedSize, ZeroConstructor)
	class USoundCue*                                   Sound;                                                    // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.BoneParticlesAfflictionEffect");
		return ptr;
	}

};


// Class FSD.AnimatedItemParticleAfflictionEffect
// 0x0018 (0x0040 - 0x0028)
class UAnimatedItemParticleAfflictionEffect : public UAfflictionEffect
{
public:
	EItemCategory                                      ItemCategory;                                             // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	class UParticleSystem*                             ParticleEffect;                                           // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       Socket;                                                   // 0x0038(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AnimatedItemParticleAfflictionEffect");
		return ptr;
	}

};


// Class FSD.PlayerCharacterMontageAfflictionEffect
// 0x0028 (0x0050 - 0x0028)
class UPlayerCharacterMontageAfflictionEffect : public UAfflictionEffect
{
public:
	class UAnimMontage*                                FP_Montage;                                               // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAnimMontage*                                TP_Montage;                                               // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              BlendOut;                                                 // 0x0038(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	TArray<struct FName>                               RandomStarts;                                             // 0x0040(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.PlayerCharacterMontageAfflictionEffect");
		return ptr;
	}

};


// Class FSD.FSDPawn
// 0x0048 (0x03D8 - 0x0390)
class AFSDPawn : public APawn
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0390(0x0010) MISSED OFFSET
	class UStatusEffectsComponent*                     StatusEffects;                                            // 0x03A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UEnemyTemperatureComponent*                  Temperature;                                              // 0x03A8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x03B0(0x0020) (Edit, BlueprintVisible)
	bool                                               IsFrozen;                                                 // 0x03D0(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               CanFlee;                                                  // 0x03D1(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsFleeing;                                                // 0x03D2(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x03D3(0x0005) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FSDPawn");
		return ptr;
	}


	void UnFreeze();
	void StopFleeing();
	void StartFleeing(struct FVector* fromLocation);
	void SetAlerted(bool* isAlerted);
	void OnUnFrozen();
	void OnStoppedFleeing();
	void OnStartedFleeing();
	void OnRep_IsFrozen();
	void OnFrozen();
	void OnArmorPartsDestroyedFromRadialDamage(TArray<unsigned char>* destroyedParts);
	void MakeRagdollMesh(class USkeletalMeshComponent** Mesh);
	bool GetIsAlerted();
	class UHealthComponentBase* GetHealthComponent();
	void Freeze();
	void BackOffFromLocation(struct FVector* fromLocation);
	void All_ArmorPartsDestroyed(TArray<unsigned char>* parts);
};


// Class FSD.DeepPathfinderCharacter
// 0x0068 (0x0440 - 0x03D8)
class ADeepPathfinderCharacter : public AFSDPawn
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x03D8(0x0008) MISSED OFFSET
	class UDeepPathfinderMovement*                     PathfinderMovement;                                       // 0x03E0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x03E8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FName                                       CenterMassSocketName;                                     // 0x03F0(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UDeepPatherFinderCharacterAfflictionComponent* affliction;                                               // 0x03F8(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	float                                              AnimationOffset;                                          // 0x0400(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               CanPlayerStandOn;                                         // 0x0404(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               UseDormancy;                                              // 0x0405(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0406(0x0002) MISSED OFFSET
	float                                              StaggerDurationMultiplier;                                // 0x0408(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StaggerImunityWindow;                                     // 0x040C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               IsHidden;                                                 // 0x0410(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               IsStaggered;                                              // 0x0411(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData02[0x6];                                       // 0x0412(0x0006) MISSED OFFSET
	float                                              AttackerRadius;                                           // 0x0418(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x041C(0x0004) MISSED OFFSET
	TArray<class UMaterialInterface*>                  CachedMaterials;                                          // 0x0420(0x0010) (ZeroConstructor, Transient)
	float                                              AllowedInFormationChance;                                 // 0x0430(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0xC];                                       // 0x0434(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.DeepPathfinderCharacter");
		return ptr;
	}


	void TryJoinFormation();
	void SetHidden(bool* shouldHide);
	void OnPausedMovementElapsed();
	void LeaveFormation();
};


// Class FSD.EnemyDeepPathfinderCharacter
// 0x0020 (0x0460 - 0x0440)
class AEnemyDeepPathfinderCharacter : public ADeepPathfinderCharacter
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0440(0x0008) MISSED OFFSET
	class UEnemyHealthComponent*                       HealthComponent;                                          // 0x0448(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FQueuedMontage                              QueuedMontage;                                            // 0x0450(0x0010) (Net, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.EnemyDeepPathfinderCharacter");
		return ptr;
	}


	void OnRep_QueuedMontage();
};


// Class FSD.AFlyingBug
// 0x00D8 (0x0538 - 0x0460)
class AAFlyingBug : public AEnemyDeepPathfinderCharacter
{
public:
	class UEnemyComponent*                             EnemyComponent;                                           // 0x0460(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UPawnStatsComponent*                         PawnStats;                                                // 0x0468(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UOutlineComponent*                           Outline;                                                  // 0x0470(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UPawnSensingComponent*                       Senses;                                                   // 0x0478(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            ExplosionSphere;                                          // 0x0480(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UAudioComponent*                             WingSoundComponent;                                       // 0x0488(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnStartFizzle;                                            // 0x0490(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class UAnimSequenceBase*>                   HitReactions;                                             // 0x04A0(0x0010) (Edit, ZeroConstructor)
	struct FVector_NetQuantize                         RagdollImpact;                                            // 0x04B0(0x000C) (Net, Transient)
	unsigned char                                      UnknownData00[0x1C];                                      // 0x04BC(0x001C) MISSED OFFSET
	class AActor*                                      RotateTarget;                                             // 0x04D8(0x0008) (Net, ZeroConstructor, Transient, IsPlainOldData)
	class UPhysicsAsset*                               PhysicalAssetAfterDeath;                                  // 0x04E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UPhysicalMaterial*                           FrozenMaterial;                                           // 0x04E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UPhysicsAsset*                               FrozenAsset;                                              // 0x04F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class USoundCue*                                   FrozenDeathSound;                                         // 0x04F8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UParticleSystem*                             FrozenDeathparticles;                                     // 0x0500(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class USoundBase*                                  ChatterSound;                                             // 0x0508(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UEnemyRangedAttack*                          RangedAttack;                                             // 0x0510(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FirstHitReactBlendIn;                                     // 0x0518(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              OverrideHitReactBlendIn;                                  // 0x051C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DistanceForAttackMode;                                    // 0x0520(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinChatterDelay;                                          // 0x0524(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxChatterDelay;                                          // 0x0528(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              AttackModeRotationSpeed;                                  // 0x052C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x0530(0x0001) MISSED OFFSET
	bool                                               UsesAttackStance;                                         // 0x0531(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               SetLifeTime;                                              // 0x0532(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               AttackStance;                                             // 0x0533(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               LookStraight;                                             // 0x0534(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               UseDefaultRagdoll;                                        // 0x0535(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x0536(0x0002) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AFlyingBug");
		return ptr;
	}


	void TriggerFrozenRagdoll();
	void StartFizzle();
	void SetExternallyControlled(bool* isExternallyControlled);
	void SetAttackStance(bool* isAttackStance);
	void Ragdoll(bool* applyForce, struct FVector* force);
	void PlayVoice();
	void OnRep_RagdollImpact();
	void OnRagdoll();
	void OnFreezeImpact(class UPrimitiveComponent** HitComponent, class AActor** OtherActor, class UPrimitiveComponent** OtherComp, struct FVector* NormalImpulse, struct FHitResult* Hit);
	void OnDamaged(float* amount);
	void OnBugDeath(class UHealthComponentBase** Health);
	float GetMidZpointFromCielingAndFloor(float* distanceFromCieling, float* distanceFromFloor);
	bool GetIsInAttackStance();
	void AlertNearbyEnemies();
};


// Class FSD.EnemyAnimInstance
// 0x0050 (0x02C0 - 0x0270)
class UEnemyAnimInstance : public UAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0270(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnMeleeAttackNotify;                                      // 0x0278(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnStopLeadingNotify;                                      // 0x0288(0x0010) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnIsAttackingChanged;                                     // 0x0298(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               IsAttacking;                                              // 0x02A8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               IsAlive;                                                  // 0x02A9(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x02AA(0x0002) MISSED OFFSET
	float                                              RandomStartPosition;                                      // 0x02AC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	class UHealthComponentBase*                        HealthComponent;                                          // 0x02B0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x02B8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.EnemyAnimInstance");
		return ptr;
	}


	bool IsSlotPlayingAnyAnimation(struct FName* SlotNodeName);
	class USkeletalMeshComponent* GetSkeletalMesh();
};


// Class FSD.SimpleMovingEnemyAnimInstance
// 0x0030 (0x02F0 - 0x02C0)
class USimpleMovingEnemyAnimInstance : public UEnemyAnimInstance
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x02C0(0x0008) MISSED OFFSET
	float                                              WalkCycleSpeed;                                           // 0x02C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StartMovingSpeed;                                         // 0x02CC(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              StopMovingSpeed;                                          // 0x02D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WalkCycleMinRate;                                         // 0x02D4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              WalkCyclePlayRate;                                        // 0x02D8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              MeshScale;                                                // 0x02DC(0x0004) (Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               IsMoving;                                                 // 0x02E0(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF];                                       // 0x02E1(0x000F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.SimpleMovingEnemyAnimInstance");
		return ptr;
	}


	void SetMeshScale(float* NewScale);
};


// Class FSD.FlyingBugAnimInstance
// 0x0000 (0x02F0 - 0x02F0)
class UFlyingBugAnimInstance : public USimpleMovingEnemyAnimInstance
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.FlyingBugAnimInstance");
		return ptr;
	}

};


// Class FSD.AIFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAIFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AIFunctionLibrary");
		return ptr;
	}


	void STATIC_SetAICanSense(bool* canSense);
	int STATIC_MakeEnemiesFleeFromArea(class UObject** WorldContextObject, struct FVector* Center, float* Radius, int* maxEnemiesAffected);
	void STATIC_MakeEnemiesBackOutOfArea(class UObject** WorldContextObject, struct FVector* Center, float* Radius);
	bool STATIC_IsEnemyAlertet(class APawn** enemy);
	class APlayerCharacter* STATIC_GetPlayerTarget(class AActor** From, float* MaxDistance, bool* MustBeAlive, bool* MustBeUnparalyzed, bool* accountForAttackers, class AActor** ignoreTarget, bool* IsFlying);
	class UAttackerPositioningComponent* STATIC_GetAttackableTarget(class AActor** From, float* MaxDistance, bool* MustBeAlive, bool* MustBeUnparalyzed, bool* accountForAttackers, class AActor** ignoreTarget, bool* IsFlying);
	class APlayerCharacter* STATIC_ConsiderChangingTarget(class APlayerCharacter** CurrentTarget, class AActor** From, float* MaxDistance, bool* MustBeAlive, bool* MustBeUnparalyzed, bool* CurrentTargetMustBeAlive, bool* IsFlying);
	void STATIC_AlertEnemy(class APawn** enemy);
	void STATIC_AlertEnemiesInRange(class UObject** WorldContextObject, struct FVector* Origin, float* Range, class APawn** alerter);
};


// Class FSD.EnemyGroupDescriptor
// 0x0020 (0x0050 - 0x0030)
class UEnemyGroupDescriptor : public UDataAsset
{
public:
	TArray<struct FEnemyGroupDescriptorItem>           Enemies;                                                  // 0x0030(0x0010) (Edit, ZeroConstructor)
	struct FRandInterval                               Diversity;                                                // 0x0040(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.EnemyGroupDescriptor");
		return ptr;
	}

};


// Class FSD.AmberEventEnemyPool
// 0x0018 (0x0068 - 0x0050)
class UAmberEventEnemyPool : public UEnemyGroupDescriptor
{
public:
	float                                              MaxTimeBetweenSpawn;                                      // 0x0050(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              MinTimeBetweenSpawn;                                      // 0x0054(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                MaxEnemyCap;                                              // 0x0058(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                AmbersNeededdToComplete;                                  // 0x005C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                AmbersNeededOnePlayer;                                    // 0x0060(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class FSD.AmberEventEnemyPool");
		return ptr;
	}

};


// Class FSD.GameEvent
// 0x0148 (0x0478 - 0x0330)
class AGameEvent : public AActor
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0330(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    EventTriggeredDelegate;                                   // 0x0338(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    EventFinishedDelegate;                                    // 0x0348(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    StageCompleteDelegate;                                    // 0x0358(0x0010) (ZeroConstructor, InstancedReference)
	struct FScriptMulticastDelegate                    ProgressChangedDelegate;                                  // 0x0368(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    TimeProgressChanged;                                      // 0x0378(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    ObjectivesPerStageChanged;                                // 0x0388(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<class AEventStarterButton*>                 StarterObjects;                                           // 0x0398(0x0010) (ZeroConstructor)
	bool                                               bGameEventSetup;                                          // 0x03A8(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x03A9(0x0007) MISSED OFFSET
	struct FText                                       EventName;                                                // 0x03B0(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FText                                       ObjectiveText;                                            // 0x03C8(0x0018) (Edit, BlueprintVisible, BlueprintReadOnly)
	struct FName                                       AnalyticsName;                                            // 0x03E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	TArray<class UDialogDataAsset*>                    StageCompleteShouts;                                      // 0x03E8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor)
	struct FGameplayTagContainer                       GameplayTags;                                             // 0x03F8(0x0020) (Edit, BlueprintVisible, BlueprintReadOnly)
	class UChildActorComponent*                        StartEventObject;                                         // 0x0418(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UDialogDataAsset*                            EventTriggeredShout;                                      // 0x0420(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDialogDataAsset*                            EventFinishedShout;                                       // 0x0428(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UDialogDataAsset*                            EventFailedShout;                                         // 0x0430(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EventTriggeredShoutDelay;                                 // 0x0438(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EventFinishedShoutDelay;                                  // 0x043C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              StageProgress;                                            // 0x0440(0x0004) (Net, ZeroConstructor, Transient, IsPlainOldData)
	float                                              TimeLimit;                                                // 0x0444(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              DelayUITime;                                              // 0x0448(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x044C(0x0008) MISSED OFFSET
	int                                                objectivesPerStage;                                       // 0x0454(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x4];                                       // 0x0458(0x0004) MISSED OFFSET
	bool                                               EventStartersActive;                                      // 0x045C(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               StopScriptedWavesWhileActive;                             // 0x045D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               StopNormalWavesWhileActive;                               // 0x045E(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               EventStarted;                                             // 0x045F(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               FailedEvent;                                              // 0x0460(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               ShowRemainingTimeOnHUD;                                   // 0x0461(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
